export const digcompAreas = [
    {
        id: "professionalEngagement",
        label: "1. المشاركة المهنية",
        topics: [
            "التواصل التنظيمي",
            "التعاون المهني",
            "الممارسة التأملية",
            "التطوير المهني الرقمي",
        ],
    },
    {
        id: "digitalResources",
        label: "2. الموارد الرقمية",
        topics: [
            "الاختيار",
            "التطوير والتعديل",
            "الإدارة والحماية",
            "المشاركة",
        ],
    },
    {
        id: "teachingLearning",
        label: "3. التدريس والتعلم",
        topics: [
            "التدريس",
            "التوجيه",
            "التعلم التعاوني",
            "التعلم الذاتي",
        ],
    },
    {
        id: "assessment",
        label: "4. التقييم",
        topics: [
            "استراتيجيات التقييم",
            "تحليل النتائج",
            "التغذية الراجعة والتخطيط",
        ],
    },
    {
        id: "empoweringLearners",
        label: "5. تمكين المتعلمين",
        topics: [
            "الوصولية والدمج",
            "التفريد والتخصيص",
            "إشراك المتعلمين بنشاط",
        ],
    },
    {
        id: "facilitatingLearners",
        label: "6. تمكين المتعلمين رقمياً",
        topics: [
            "مهارات المعلومات والوسائط",
            "التواصل",
            "إنشاء المحتوى",
            "حل المشكلات",
        ],
    },
];
